Tekla Open API Reference for Tekla Structures 2025
RebarMesh.RebarMeshSpacingMethodEnum Enumeration
 The ways to distribute the reinforcing bars with different spacings.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarMeshSpacingMethodEnum
Public Enumeration RebarMeshSpacingMethodEnum
Members
Member name | Value | Description
SPACING_TYPE_UNDEFINED | 0 |  The undefined spacing type.
SPACING_TYPE_SAME_DISTANCE | 1 |  Distributes the bars using the same distance for all bars.
SPACING_TYPE_MULTIPLE_VARYING_DISTANCES | 2 |  Varying distribution of the bars.
See Also
Reference
Tekla.Structures.Model Namespace